[DoomEternalBFG X2WeaponTemplate]
FriendlyName="BFG-9000"
FriendlyNamePlural="BFG-9000"
BriefSummary="即使是现在，BFG-9000依然是UAC设计过的最强武器，它能够释放出最纯粹的亚金离子弹。这种过热的能量球在发射出去后在亚空间的作用下起伏不定，并在靠近任何有机物后立即从内部发生致命爆炸。UAC最近将它大量部署在火卫一，托它的福，其升级版BFG-10000防御站想必也很快就会投入使用。在BFG-10000防御站内的放大阵列中时，BFG可以通过一系列反应透镜环发射；这些环将不断流动的气态亚金泵入枪管，点燃带电等离子，产生足以裂解行星表面的巨大能量波。"
TacticalText="<Bullet/> 在没有特殊训练的情况下，使用主武器攻击会结束士兵的回合。\n<Bullet/> 通过配件改造来提升BFG-9000的战斗力。（LWOTC禁用升级）"
AbilityDescName="BFG-9000"

[FireEternalBFGLauncher X2AbilityTemplate]
LocFriendlyName="*激烈的XCOM脏话*"
LocLongDescription="粗俗的XCOM俚语-发射一枚在效果范围内造成伤害的弹丸，附带大量脏话。"
LocHelpText="优雅的XCOM问候-发射一枚在效果范围内造成伤害的弹丸，祝福变种人的全家。"
LocFlyOverText="*激烈的XCOM粗口*"


